In [133]:
import pandas as pd

In [ ]:
#задача1

In [73]:
ratings = pd.read_csv('ratings.csv')
#
ratings.head(5)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [75]:
#ratings.info()

In [103]:
ratings[ratings['rating']==5.0].groupby('movieId').count().sort_values('rating', ascending=False).head(1)

         userId  rating  timestamp
movieId
318         153     153        153

In [104]:
#задача2

In [134]:
geo_ = pd.read_csv('power.csv')

In [140]:
geo_.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [136]:
type(geo_)

pandas.core.frame.DataFrame

In [158]:
(geo_[(
    (geo_['country']=='Latvian')|
      (geo_['country']=='Lithuania')|
      (geo_['country']=='Estonia')
     )&(
       (geo_['category']==4)|
        (geo_['category']==12)|
        (geo_['category']==21)
      )]
     .groupby('country').agg('sum').head()
)

              year  quantity  category
country
Estonia     764850  266014.0      6220
Lithuania  1141327  495811.0      9282

In [160]:
#задача3

In [165]:
tables = pd.read_html("https://www.finanz.ru/valyuty/v-realnom-vremeni")

tab_0=tables[0]
print(tab_0)
type(tab_0)

         0        1      2        3       4     5               6       7   \
0  аааа   2Т 951  -0,4%   Nasdaq  8Т 473  0,1%  ааИбаКаОаЙаН  8Т 756
1    а аЂаЁ   1Т 449  -0,8%   S&P500  3Т 089  0,1%      ааЕббб     621
2       Dow  27Т 674  -0,1%  FTSE100  7Т 365  0,5%    ааОаЛаОбаО  1Т 458

      8        9       10     11
0   0,3%  USD/RUB  642170   0,5%
1  -0,4%  EUR/RUB  706964   0,4%
2   0,1%  EUR/USD   11009  -0,2%

pandas.core.frame.DataFrame